#+TITLE:      Org-balance documentation
#+AUTHOR:     Ilya Shlyakhter
#+EMAIL:      ilya_shl AT alum DOT mit DOT edu
#+INFOJS_OPT: view:info toc:nil

Org-Balance Documentation

* Introduction

  Org-balance is an [[http://orgmode.org][Org mode]] extension that helps balance your resources (time/money/etc) among your various areas of life.
  You set goals for how much to spend or how much to get done in a given area (i.e. subtree) per day/week/month, and Org-balance
  tells you how you're keeping up.  You use Org mode's normal facilities for [[http://orgmode.org/manual/Clocking-work-time.html#Clocking-work-time][clocking work time]] and [[http://orgmode.org/manual/Closing-items.html#Closing-items][closing items]], and
  Org-balance uses the resulting records to compute your actual expenditures/achievements and compare them to your goals.

  For example, suppose you have an Org file that looks like this:
  
  and now more text.

  And BEFORE.

#+BEGIN_SRC org :exports both :results replace html
  
  ,* my life
  ,*** work
  ,***** GOAL 60-80 hours/week
  ,***** Current projects
  ,******* find new funding
  ,********* GOAL 10% of [[file:orgb-docs.org::*60-80%20hours/week][60-80 hours/week]]
  ,******* supervise students
  ,********* Mike
  ,********* Jill
  ,******* solve problem N
  ,***** Longer-term projects
  ,******* prove P != NP
  ,*** hobbies
  ,***** GOAL 5 hrs/week
  ,***** remodel kitchen
  ,***** learn pottery
  ,***** hack open-source projects
  ,******* org
  ,******* gimp
  ,          
#+END_SRC

#+RESULTS:
#+BEGIN_HTML
<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">my life</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">work</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="done GOAL"> GOAL</span> 60-80 hours/week</h4>
<div class="outline-text-4" id="text-1-1-1">

</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">Current projects</h4>
<div class="outline-text-4" id="text-1-1-2">

<ul>
<li id="sec-1-1-2-1">find new funding<br/>
<ul>
<li id="sec-1-1-2-1-1"><span class="done GOAL"> GOAL</span> 10% of <a href="orgb-docs.html">60-80 hours/week</a><br/>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1-1-2-2">supervise students<br/>
<ul>
<li id="sec-1-1-2-2-1">Mike<br/>
</li>
</ul>
<ul>
<li id="sec-1-1-2-2-2">Jill<br/>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1-1-2-3">solve problem N<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-1-1-3" class="outline-4">
<h4 id="sec-1-1-3">Longer-term projects</h4>
<div class="outline-text-4" id="text-1-1-3">

<ul>
<li id="sec-1-1-3-1">prove P != NP<br/>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">hobbies</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="done GOAL"> GOAL</span> 5 hrs/week</h4>
<div class="outline-text-4" id="text-1-2-1">

</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">remodel kitchen</h4>
<div class="outline-text-4" id="text-1-2-2">

</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3">learn pottery</h4>
<div class="outline-text-4" id="text-1-2-3">

</div>

</div>

<div id="outline-container-1-2-4" class="outline-4">
<h4 id="sec-1-2-4">hack open-source projects</h4>
<div class="outline-text-4" id="text-1-2-4">

<ul>
<li id="sec-1-2-4-1">org<br/>
</li>
</ul>
<ul>
<li id="sec-1-2-4-2">gimp<br/>

</li>
</ul>
</div>
</div>
</div>
</div>
#+END_HTML


  And AFTER.
  
  Then here are some goals you can set:
     - spend at least 10 hours/day on work
		   - make sure that includes at least 5 hours/week on project B
	  - complete at least one task every three days under project C
	  
	  - don't let yourself spend more than 10 hours/week hacking orgmode (it draws you in...)
	  
	  - spend at most $N on gifts
	  
	  - complete at least one annoying but necessary task a week
	  
	  - give yourself at most one gift for each annoying task completed.
	  
	( alternative is to give the syntax and then explain what it means ).  

  and some more notes afterwards.
  
